import numpy as np


def f(t, y, mu):
    r = y[:3]
    v = y[3:]

    rn = np.linalg.norm(r)

    a = -mu * r / rn ** 3

    return np.concatenate((v, a))


y = np.array([1, 2, 3, 4, 5, 6], dtype=float)

z = f(0, y, 398600)

print(z)

z[0] = 100

print(y)
print(z)

# y не изменяется, потому что функция создает новый массив z
# входная и выходная переменные хранятся отдельно

# [ 4.00000000e+00  5.00000000e+00  6.00000000e+00 -7.60930936e+03
#  -1.52186187e+04 -2.28279281e+04]
# [1. 2. 3. 4. 5. 6.]
# [ 1.00000000e+02  5.00000000e+00  6.00000000e+00 -7.60930936e+03
#  -1.52186187e+04 -2.28279281e+04]