import numpy as np

A = np.array([[3, 1, 0], [0, 3, 1], [0, 0, 3]])

w, v = np.linalg.eig(A)

print(w)
print(v)

d = np.linalg.det(v)
r = np.linalg.matrix_rank(v)

print(d)
print(r)

if d == 0 or r < 3:
    print("Собственные векторы линейно зависимы")
else:
    print("Собственные векторы линейно независимы")

# [3. 3. 3.]
# [[ 1.00000000e+00 -1.00000000e+00  1.00000000e+00]
#  [ 0.00000000e+00  6.66133815e-16 -6.66133815e-16]
#  [ 0.00000000e+00  0.00000000e+00  4.43734259e-31]]
# 2.9558639481851626e-46
# 1
# Собственные векторы линейно зависимы